# Sales Dataset

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt


df=pd.read_csv('./walmart.csv')
df

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,7969
...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,B,1,1,20,368
550064,1006035,P00375436,F,26-35,1,C,3,0,20,371
550065,1006036,P00375436,F,26-35,15,B,4+,1,20,137
550066,1006038,P00375436,F,55+,1,C,2,0,20,365
550067,1006039,P00371644,F,46-50,0,B,4+,1,20,490

In [7]:
df.head(10)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,7969
5,1000003,P00193542,M,26-35,15,A,3,0,1,15227
6,1000004,P00184942,M,46-50,7,B,2,1,1,19215
7,1000004,P00346142,M,46-50,7,B,2,1,1,15854
8,1000004,P0097242,M,46-50,7,B,2,1,1,15686
9,1000005,P00274942,M,26-35,20,A,1,1,8,7871

In [8]:
df.describe()

,User_ID,Occupation,Marital_Status,Product_Category,Purchase
count,5.500680e+05,550068.000000,550068.000000,550068.000000,550068.000000
mean,1.003029e+06,8.076707,0.409653,5.404270,9263.968713
std,1.727592e+03,6.522660,0.491770,3.936211,5023.065394
min,1.000001e+06,0.000000,0.000000,1.000000,12.000000
25%,1.001516e+06,2.000000,0.000000,1.000000,5823.000000
50%,1.003077e+06,7.000000,0.000000,5.000000,8047.000000
75%,1.004478e+06,14.000000,1.000000,8.000000,12054.000000
max,1.006040e+06,20.000000,1.000000,20.000000,23961.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 10 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category            550068 non-null  int64
 9   Purchase                    550068 non-null  int64
dtypes: int64(5), object(5)
memory usage: 42.0+ MB

In [6]:
df.select_dtypes(include='number')

        User_ID  Occupation  Marital_Status  Product_Category  Purchase
0       1000001          10               0                 3      8370
1       1000001          10               0                 1     15200
2       1000001          10               0                12      1422
3       1000001          10               0                12      1057
4       1000002          16               0                 8      7969
...         ...         ...             ...               ...       ...
550063  1006033          13               1                20       368
550064  1006035           1               0                20       371
550065  1006036          15               1                20       137
550066  1006038           1               0                20       365
550067  1006039           0               1                20       490

[550068 rows x 5 columns]

### 구매금액 합계 Top 10 고객

In [12]:
top_sum=df.groupby('User_ID')['Purchase'].sum().sort_values(ascending=False).head(10)
top_sum

User_ID
1004277    10536909
1001680     8699596
1002909     7577756
1001941     6817493
1000424     6573609
1004448     6566245
1005831     6512433
1001015     6511314
1003391     6477160
1001181     6387961
Name: Purchase, dtype: int64

### 구매금액 평균 Top10 고객

In [14]:
top_avg=df.groupby('User_ID')['Purchase'].mean().sort_values(ascending=False).head(10)
top_avg

User_ID
1003902    18577.893617
1005069    18490.166667
1005999    18345.944444
1001349    18162.739130
1003461    17508.700000
1000101    17246.439394
1002983    16790.612903
1005994    16787.071429
1000592    16776.571429
1004474    16639.941176
Name: Purchase, dtype: float64

### 구매 항목 개수 Top10 고객

In [16]:
top_count=df.groupby('User_ID')['Purchase'].count().sort_values(ascending=False).head(10)
top_count

User_ID
1001680    1026
1004277     979
1001941     898
1001181     862
1000889     823
1003618     767
1001150     752
1001015     740
1005795     729
1005831     727
Name: Purchase, dtype: int64

### VIP 고객 수 추출(중복포함)

In [18]:
vip_id=set(top_sum.index) | set(top_avg.index) |set(top_count.index)
len(vip_id)

24

### VIP 고객 특성

In [20]:
vip_df=df[df['User_ID'].isin(vip_id)]
vip_df

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category,Purchase
547,1000101,P00278042,F,18-25,3,A,1,0,1,19464
548,1000101,P00154042,F,18-25,3,A,1,0,1,19027
549,1000101,P00014042,F,18-25,3,A,1,0,1,19394
550,1000101,P00262242,F,18-25,3,A,1,0,1,15871
2619,1000424,P00246142,M,26-35,17,A,3,0,1,15802
...,...,...,...,...,...,...,...,...,...,...
548573,1003902,P00370853,M,26-35,5,C,2,0,19,38
548828,1004277,P00371644,M,36-45,16,A,0,0,20,126
548947,1004448,P00375436,M,26-35,14,A,0,0,20,367
549401,1005069,P00372445,F,55+,0,C,3,1,20,597
549898,1005795,P00371644,M,26-35,1,A,1,1,20,595

In [31]:
df.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category',
       'Purchase'],
      dtype='object')

### 성별,연령,직업,지역,결혼여부,구매품목별 분포 확인(주의)

In [ ]:
vip_df['Gender'].value_counts()  #성별
vip_df['Age'].describe()         #연령
vip_df['Marital_Status'].value_counts() #결혼여부

Marital_Status
0    6365
1    4966
Name: count, dtype: int64

### 직업명 데이터 형식이 맞지않음

In [26]:
vip_df['Occupation'].value_counts()

Occupation
20    2601
17    2359
7     1620
1     1516
16     979
3      806
4      729
14     575
5       94
0       52
Name: count, dtype: int64

In [34]:
df['Occupation'].unique()   #직업이 21개의 항목이 있다는 것을 확인함

array([10, 16, 15,  7, 20,  9,  1, 12, 17,  0,  3,  4, 11,  8, 19,  2, 18,
        5, 14, 13,  6])

In [36]:
occupation_map={    
    0: "학생",
    1: "회사원",
    2: "프리랜서",
    3: "공무원",
    4: "사업가",
    5: "서비스직",
    6: "전문직",
    7: "주부",
    8: "기타",
    9: "교육직",
    10: "기술직",
    11: "연구직",
    12: "의료직",
    13: "자영업",
    14: "경영자",
    15: "영업직",
    16: "군인",
    17: "예술가",
    18: "운전/운수업",
    19: "무직/은퇴",
    20: "농림어업"
    }

In [37]:
df['Occupation']=df['Occupation'].map(occupation_map)

In [41]:
df['Occupation'].unique()  #데이터 타입 정정 완료

array(['기술직', '군인', '영업직', '주부', '농림어업', '교육직', '회사원', '의료직', '예술가', '학생',
       '공무원', '사업가', '연구직', '기타', '무직/은퇴', '프리랜서', '운전/운수업', '서비스직',
       '경영자', '자영업', '전문직'], dtype=object)